Tutaj inicjalizacja bazy danych i załadowanie tymaczasowych danych. Inicjalizacja jest wykonywana zgodnie ze skryptami z pliku setup_db. Po kolei wykonywane są kody sql ze skryptów w lokalizacji db/scripts. Dane są ładowane z pliku db/initial_data/initial_data.xlsx.

W tym pliku jest przedstawiony sposób działania tych skryptów

In [17]:
import sqlite3
import pandas as pd
import os
from setup_db import DB, setup_db

In [18]:
def setup_db():
    db = DB("db/test_db.db")
    db.run_setup_scripts()
    db.insert_initial_data()
    return db

In [19]:
db = setup_db()

In [20]:
db = DB("db/test_db.db")
db.setup_scripts_paths

['db/scripts/create_tables.sql',
 'db/scripts/create_views.sql',
 'db/scripts/create_triggers.sql']

In [21]:
db.run_setup_scripts()

In [22]:
db.show_tables()

[('users',),
 ('jobs',),
 ('requests',),
 ('distances',),
 ('results',),
 ('cities',),
 ('execution_logs',),
 ('working_days',)]

In [23]:
db.select_all("cities")

   city_id city_name
0     1915    Kraków
1     1815    Gdańsk
2     7588      Łódź

In [24]:
db.select_all("users")

   user_id   name password  admin  active         time_created
0        1   adam    pass1      0       1  2019-10-10 00:00:00
1        2    tom    pass2      0       1  2019-10-10 00:00:00
2        3  admin    admin      1       1  2019-10-10 00:00:00

In [25]:
db.select_all("jobs")

   job_id  user_created  active         time_created last_run  job_name
0       1             1       1  2019-10-10 00:00:00     None  test_job

In [26]:
db.select_all("requests")

   request_id  job_id  start_city  end_city                 date
0           1       1        1915      1815  2020-01-02 00:00:00
1           2       1        1915      7588  2020-01-02 00:00:00
2           3       1        1915      7588  2020-01-03 00:00:00

In [27]:
db.select_all("requests")

   request_id  job_id  start_city  end_city                 date
0           1       1        1915      1815  2020-01-02 00:00:00
1           2       1        1915      7588  2020-01-02 00:00:00
2           3       1        1915      7588  2020-01-03 00:00:00

In [28]:
db.close()

In [29]:
db.remove_db_file()